# helper for strings

class Helper(object):
    HELP_M = '''अपनी सहायता के लिए श्रेणी चुनें।
समर्थन चैट पर अपने संदेह पूछें sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ

सभी कमांड : / के साथ उपयोग किए जा सकते हैं'''
    HELP_ChatGPT = '''CʜᴀᴛGPT

CʜᴀᴛGPT ᴄᴏᴍᴍᴀɴᴅꜱ:

/ask ➠ एआई मॉडल से आपके प्रश्न का जवाब पाने के लिए क्वेरी करें। 
'''

    HELP_Sticker = '''sᴛɪᴄᴋᴇʀs

sᴛɪᴄᴋᴇʀs ᴄᴏᴍᴍᴀɴᴅꜱ:

/packkang ➠ दूसरे पैक से स्टिकर्स का एक पैक बनाता है। 
/stickerid ➠ एक स्टिकर का स्टिकर आईडी प्राप्त करता है। 
'''

    HELP_TagAll = '''Tᴀɢ

  Tᴀɢ ᴄᴏᴍᴍᴀɴᴅꜱ:

✿ ᴄʜᴏᴏsᴇ ᴛᴀɢ ɪɴ ʏᴏᴜʀ ᴄʜᴀᴛ ✿

๏ /all ➛ ᴛᴀɢ ᴀʟʟ ɢʀᴏᴜᴘ ᴍᴇᴍʙᴇʀs ᴛᴀɢ sᴛᴏᴘ /ᴄᴀɴᴄᴇʟ

๏ /gmtag ➛ ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ 
ᴛᴀɢ sᴛᴏᴘ ⇴ /gmstop

๏ /gntag ➛ ɢᴏᴏᴅ ɴɪɢʜᴛ ᴛᴀɢ sᴛᴏᴘ ⇴ /gnstop

๏ /tagall ➛ ʀᴀɴᴅᴏᴍ ᴍᴇssᴀɢᴇ ᴛᴀɢ sᴛᴏᴘ ⇴ /tagoff /tagstop

๏ /hitag ➛ ʀᴀɴᴅᴏᴍ ʜɪɴᴅɪ ᴍᴇssᴀɢᴇ ᴛᴀɢ sᴛᴏᴘ ⇴/histop

๏ /shayari ➛ ʀᴀɴᴅᴏᴍ sʜᴀʏᴀʀɪ ᴛᴀɢ sᴛᴏᴘ ⇴ /shstop

๏ /utag ➛ ᴀɴʏ ᴡʀɪᴛᴛᴇɴ ᴛᴇxᴛ ᴛᴀɢ sᴛᴏᴘ ⇴ /cancel 

๏ /vctag ➛ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ɪɴᴠɪᴛᴇ ᴛᴀɢ sᴛᴏᴘ ⇴ /vcstop

๏ /tagram ➛ ᴛᴀɢ ᴀʟʟ ᴊᴀɪ sʜʀᴇᴇ ʀᴀᴍ 🙏
'''

    HELP_Info = '''Iɴꜰᴏ

Iɴꜰᴏ ᴄᴏᴍᴍᴀɴᴅꜱ:

/id : मौजूदा समूह आईडी प्राप्त करें। यदि किसी संदेश का जवाब देते समय उपयोग किया जाता है, तो उस उपयोगकर्ता की आईडी प्राप्त करें।
/info : एक उपयोगकर्ता के बारे में जानकारी प्राप्त करें। 
/github <ᴜsᴇʀɴᴀᴍᴇ> : एक गिथब उपयोगकर्ता के बारे में जानकारी प्राप्त करें।
'''
    HELP_Group = '''Gʀᴏᴜᴘ

Gʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅꜱ:

ᴛʜᴇsᴇ ᴀʀᴇ ᴛʜᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ɢʀᴏᴜᴘ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ᴄᴏᴍᴍᴀɴᴅs:

⦿ /pin ➠ कृपया संदेश समूह में पोस्ट करें।
⦿ /pinned ➠ समूह में पिन किया गया संदेश दिखाता है।
⦿ /unpin ➠ वर्तमान में पिन किया गया संदेश अनपिन करें।
⦿ /staff ➠ स्टाफ सदस्यों की सूची प्रदर्शित करता है।
⦿ /bots ➠ समूह में बॉट्स की सूची प्रदर्शित करता है।
⦿ /settitle ➠ ग्रुप का शीर्षक सेट करता है।
⦿ /setdiscription ➠ ग्रुप का विवरण सेट करता है।
⦿ /setphoto ➠ ग्रुप फोटो सेट करता है।
⦿ /removephoto ➠ ग्रुप फोटो हटाता है।
⦿ /zombies ➠ सदस्यों को हटाने के लिए खातों को हटाता है।
⦿ /imposter चालू/बंद ➠ आपके ग्रुप के लिए देखभालक को चालू या बंद करता है, जो उपयोगकर्ताओं को सूचित करता है जो अपना नाम या उपयोगकर्ता नाम बदलते हैं।
'''

    HELP_Extra = '''Exᴛʀᴀ

Exᴛʀᴀ ᴄᴏᴍᴍᴀɴᴅꜱ:

⦿ /math ➠ sᴏʟᴠᴇs ᴍᴀᴛʜᴇᴍᴀᴛɪᴄᴀʟ ᴘʀᴏʙʟᴇᴍs ᴀɴᴅ ᴇǫᴜᴀᴛɪᴏɴs.
⦿ /blackpink ➠ ɢᴇɴᴇʀᴀᴛᴇs ᴀ ʙʟᴀᴄᴋᴘɪɴᴋ-sᴛʏʟᴇ ʟᴏɢᴏ.
⦿ /carbon ➠ ɢᴇɴᴇʀᴀᴛᴇs ᴀ ᴄᴀʀʙᴏɴ ᴄᴏᴅᴇ ɪᴍᴀɢᴇ ғʀᴏᴍ ᴀ ᴄᴏᴅᴇ sɴɪᴘᴘᴇᴛ.
⦿ /speedtest ➠ ᴍᴇᴀsᴜʀᴇs ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ sᴘᴇᴇᴅ.
⦿ /reverse ➠ ʀᴇᴠᴇʀsᴇs ᴀ ɢɪᴠᴇɴ ᴛᴇxᴛ.
⦿ /webss ➠ ᴛᴀᴋᴇs ᴀ sᴄʀᴇᴇɴsʜᴏᴛ ᴏғ ᴀ ᴡᴇʙsɪᴛᴇ.
⦿ /paste ➠ ᴜᴘʟᴏᴀᴅs ᴀ ᴛᴇxᴛ sɴɪᴘᴘᴇᴛ ᴛᴏ ᴛʜᴇ ᴄʟᴏᴜᴅ ᴀɴᴅ ɢɪᴠᴇs ᴀ ʟɪɴᴋ.
⦿ /tgm ➠ ᴜᴘʟᴏᴀᴅs ᴀ ᴘʜᴏᴛᴏ (ᴜɴᴅᴇʀ 𝟻ᴍʙ) ᴛᴏ ᴛʜᴇ ᴄʟᴏᴜᴅ ᴀɴᴅ ɢɪᴠᴇs ᴀ ʟɪɴᴋ.
⦿ /tr ➠ ᴛʀᴀɴsʟᴀᴛᴇs ᴛᴇxᴛ.
⦿ /google ➠ sᴇᴀʀᴄʜᴇs ғᴏʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴏɴ ɢᴏᴏɢʟᴇ.
⦿ /stack ➠ sᴇᴀʀᴄʜᴇs ғᴏʀ ᴘʀᴏɢʀᴀᴍᴍɪɴɢ-ʀᴇʟᴀᴛᴇᴅ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴏɴ sᴛᴀᴄᴋ ᴏᴠᴇʀғʟᴏᴡ.
'''

    HELP_Image = '''Iᴍᴀɢᴇ

छवि कमांड:

⦿ /draw ➠ दिए गए प्रोम्प्ट पर आधारित एक आरचना बनाता है।
⦿ /image ➠ दिए गए कीवर्ड पर आधारित एक छवि खोजता है।
⦿ /upscale ➠ उसे अपस्केल करने और उसकी गुणवत्ता को सुधारने के लिए एक छवि का जवाब देता है। 
'''
    HELP_Action = '''Aᴄᴛɪᴏɴ

Aᴄᴛɪᴏɴ ᴄᴏᴍᴍᴀɴᴅꜱ:

» ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs ꜰᴏʀ Bᴀɴs & Mᴜᴛᴇ :

 ❍ /kickme: kicks the user who issued the command

Admins only:
 ❍ /ban <userhandle>: bans a user. (via handle, or reply)
 ❍ /sban <userhandle>: Silently ban a user. Deletes command, Replied message and doesn't reply. (via handle, or reply)
 ❍ /tban <userhandle> x(m/h/d): bans a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unban <userhandle>: unbans a user. (via handle, or reply)
 ❍ /kick <userhandle>: kicks a user out of the group, (via handle, or reply)
 ❍ /mute <userhandle>: silences a user. Can also be used as a reply, muting the replied to user.
 ❍ /tmute <userhandle> x(m/h/d): mutes a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unmute <userhandle>: unmutes a user. Can also be used as a reply, muting the replied to user.
__
𝐒ᴘᴇᴄɪᴀʟ 𝐂ᴏᴍᴍᴀɴᴅs 𝐒ᴜᴘᴘᴏʀᴛ 𝐀ʟʟ 𝐄xᴀᴍᴘʟᴇ  - 𝚈𝚞𝚖𝚒 𝚋𝚊𝚗 𝚈𝚞𝚖𝚒 𝚖𝚞𝚝𝚎 𝚈𝚞𝚖𝚒 𝚙𝚛𝚘𝚖𝚘𝚝𝚎 ..... 𝚎𝚝𝚌
'''
    HELP_Search = '''Sᴇᴀʀᴄʜ

Sᴇᴀʀᴄʜ ᴄᴏᴍᴍᴀɴᴅꜱ:

• /google <query> : Search the google for the given query.
• /anime <query>  : Search myanimelist for the given query.
• /stack <query>  : Search stackoverflow for the given query.
• /image (/imgs) <query> : Get the images regarding to your query

Example:
/google pyrogram: return top 5 reuslts.
'''

    HELP_Font = '''ғᴏɴᴛ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ғᴏɴᴛ ᴍᴏᴅᴜʟᴇ:

ғᴏɴᴛ ᴍᴏᴅᴜʟᴇ:

ʙʏ ᴜsɪɴɢ ᴛʜɪs ᴍᴏᴅᴜʟᴇ ʏᴏᴜ ᴄᴀɴ ᴄʜᴀɴɢᴇ ғᴏɴᴛs ᴏғ ᴀɴʏ ᴛᴇxᴛ!

◌ /font [ᴛᴇxᴛ]
'''
    HELP_Game = '''ɢᴀᴍᴇs

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ɢᴀᴍᴇs ᴍᴏᴅᴜʟᴇ:
ɢᴀᴍᴇs ᴍᴏᴅᴜʟᴇ:

ʜᴇʀᴇ ᴀʀᴇ sᴏᴍᴇ ᴍɪɴɪ ɢᴀᴍᴇs ғᴏʀ ʏᴏᴜ ᴛᴏ ᴘʟᴀʏ!

◌ /toss [ᴛᴏss ᴀ ᴄᴏɪɴ]

◌ /roll [ʀᴏʟʟ ᴀ ᴅɪᴄᴇ]

◌ /dart [ᴛʜʀᴏᴡ ᴀ ᴅᴀʀᴛ]

◌ /slot [Jᴀᴄᴋᴘᴏᴛ ᴍᴀᴄʜɪɴᴇ]

◌ /bowling [ʙᴏᴡʟɪɴɢ ɢᴀᴍᴇ]

◌ /basket [ʙᴀsᴋᴇᴛʙᴀʟʟ ɢᴀᴍᴇ]

◌ /football [ғᴏᴏᴛʙᴀʟʟ ɢᴀᴍᴇ]
'''
    HELP_TG = '''Ⓣ-ɢʀᴀᴘʜ

Ⓣ-ɢʀᴀᴘʜ ᴄᴏᴍᴍᴀɴᴅꜱ:

ᴄʀᴇᴀᴛᴇ ᴀ ᴛᴇʟᴇɢʀᴀᴘʜ ʟɪɴᴋ ᴀɴʏ ᴍᴇᴅɪᴀ!

◌ /tgm [ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ᴍᴇᴅɪᴀ]
◌ /tgt [ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ᴍᴇᴅɪᴀ]
'''
    HELP_Imposter = '''ɪᴍᴘᴏsᴛᴇʀ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ɪᴍᴘᴏsᴛᴇʀ ᴍᴏᴅᴜʟᴇ:

ɪᴍᴘᴏsᴛᴇʀ ᴍᴏᴅᴜʟᴇ:

◌ /imposter on
◌ /imposter off
'''
    HELP_TD = '''Tʀᴜᴛʜ-ᗪᴀʀᴇ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ Tʀᴜᴛʜ-ᗪᴀʀᴇ ᴍᴏᴅᴜʟᴇ:

ᴛʀᴜᴛʜ ᴀɴᴅ ᴅᴀʀᴇ
◌ /truth : sᴇɴᴅs ᴀ ʀᴀɴᴅᴏᴍ ᴛʀᴜᴛʜ sᴛʀɪɴɢ.
◌ /dare : sᴇɴᴅs ᴀ ʀᴀɴᴅᴏᴍ ᴅᴀʀᴇ sᴛʀɪɴɢ.
'''
    HELP_HT = '''ʜᴀsᴛᴀɢ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ʜᴀsᴛᴀɢ ᴍᴏᴅᴜʟᴇ:

ʜᴀsᴛᴀɢ
◌ /hastag : [ᴛᴇxᴛ]
'''
    HELP_TTS = '''ᴛᴛs

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ᴛᴛs ᴍᴏᴅᴜʟᴇ:

❀ ᴛᴛs
◌ /tts : [ᴛᴇxᴛ]

◌ ᴜsᴀɢᴇ ➛ ᴛᴇxᴛ ᴛᴏ ᴀᴜᴅɪᴏ
'''
    HELP_Fun = '''ғᴜɴ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ғᴜɴ ᴍᴏᴅᴜʟᴇ:
ᴡɪsʜ ᴍᴏᴅᴜʟᴇ:

◌ /wish : ᴀᴅᴅ ʏᴏᴜʀ ᴡɪsʜ ᴀɴᴅ sᴇᴇ ɪᴛs ᴘᴏssɪʙɪʟɪᴛʏ!

ᴍᴏʀᴇ sᴛᴜғғ:
◌ /cute [ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴄᴜᴛᴇɴᴇss]
◌ /horny [ᴄʜᴇᴄᴋ ʏᴏᴜʀ ʜᴏʀɴʏɴᴇss]
◌ /gay [ᴄʜᴇᴄᴋ ʜᴏᴡ ᴍᴜᴄʜ ɢᴀʏ ʏᴏᴜ ᴀʀᴇ]
'''
    HELP_Q = '''ǫᴜᴏᴛʟʏ

ʜᴇʀᴇ ɪs ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴛʜᴇ ǫᴜᴏᴛʟʏ ᴍᴏᴅᴜʟᴇ:

◌ /q : ᴄʀᴇᴀᴛᴇ ᴀ ǫᴜᴏᴛᴇ ғʀᴏᴍ ᴛʜᴇ ᴍᴇssᴀɢᴇ

◌ /q r : ᴄʀᴇᴀᴛᴇ ᴀ ǫᴜᴏᴛᴇ ғʀᴏᴍ ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʀᴇᴘʟʏ
'''
    
    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
}

    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
}